"""
Задание №6
Погружение в Python | Коллекции
Пользователь вводит строку текста. Вывести каждое слово с новой строки.
✔ Строки нумеруются начиная с единицы.
✔ Слова выводятся отсортированными согласно кодировки Unicode.
✔ Текст выравнивается по правому краю так, чтобы у самого длинного
слова был один пробел между ним и номером строки.
"""

user_text = input("Введите текст: ").split()
user_text.sort()
long_str = len(max(user_text, key=len))
for num,element in enumerate(user_text, 1):
    print(f'{num} {element:.>{long_str}}')
