"""
Задание №2

Пользователь вводит данные. Сделайте проверку данных
и преобразуйте если возможно в один из вариантов ниже:
✔ Целое положительное число
✔ Вещественное положительное или отрицательное число
✔ Строку в нижнем регистре, если в строке есть
хотя бы одна заглавная буква
✔ Строку в нижнем регистре в остальных случаях
"""

user = input("Введите данные: ")
if user.isdigit():
    print("Целое число")
elif user.count(".") == 1 and user.replace(".", "").replace("-", "").isdigit():
    print("Вещественное число")
elif any([sym.isupper() for sym in user]):
    print("Верхний регистр")
else:
    print("Нижний регистр")
