"""
Задание №4
✔ Напишите программу, которая вычисляет площадь
круга и длину окружности по введённому диаметру.
✔ Диаметр не превышает 1000 у.е.
✔ Точность вычислений должна составлять
не менее 42 знаков после запятой.

"""

import decimal

decimal.getcontext().prec = 42
PI = decimal.Decimal('3.14159265358979323846264338327950288419716940')
d = decimal.Decimal(input('d = '))
print(f'L = {d * PI}')
print(f'L = {len(str(d * PI))}')