"""
Задание №1
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные
"""

a1 = 3
a2 = 1
a3 = "sfsd"
a4 = [1, 2, 4, 5]
a5 = a1 / a2
print(type(a1), a1)
print(type(a2), a2)
print(type(a3), a3)
print(type(a4), a4)
print(type(a5), a5)
