# Задание №7
# ✔ Функция получает на вход словарь с названием компании в качестве ключа
# и списком с доходами и расходами (3-10 чисел) в качестве значения.
# ✔ Вычислите итоговую прибыль или убыток каждой компании. Если все компании
# прибыльные, верните истину, а если хотя бы одна убыточная — ложь.


companies = {
    'Roga': [300, -200, 500, 1000.4],
    'Kopyta': [523, 4412, -1231, 23523.3],
    'Avers': [-1241, 124214, 123, 32312.3]
}


def earn_money(my_dict):
    for company in my_dict:
        if sum(my_dict[company]) < 0:
            return False
    return True


print(earn_money(companies))
