# Задание №2
# ✔ Напишите функцию, которая принимает строку текста.
# ✔ Сформируйте список с уникальными кодами Unicode каждого
# символа введённой строки отсортированный по убыванию.
user_text = 'символа введённой строки отсортированный по убыванию.'


def some_text_unicode(text):
    res = []
    for i in set(text):  # Переводим текст во множество уникальных символов
        res.append(ord(i))  # Юникод символа добавляем в список
    return sorted(res, reverse=True)  # Возвращаем отсортированный по убыванию список


print(some_text_unicode(user_text))
